sumkindafreak/new_showduino/firmware/p4-c6-espnow-bridge/hosted-link-qualification/sdkconfig.defaults
# Showduino onboard ESP32-C6 factory-link qualification
# Target: Waveshare ESP32-P4-Module-DEV-KIT
# ESP-IDF: 5.4/5.5 family

CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# Use the C6 as the P4's hosted Wi-Fi co-processor.
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y

# Waveshare ESP32-P4-Module uses the same P4/C6 SDIO pin layout as the
# Espressif P4 Function EV board: P4 18=CLK, 19=CMD, 14..17=D0..D3,
# 54=C6 CHIP_PU/reset.
CONFIG_ESP_HOSTED_P4_DEV_BOARD_FUNC_BOARD=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y

# Qualification only needs STA mode and passive/active scanning.
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000
